Tekla Open API Reference for Tekla Structures 2025
AttributesBase Class
 The AttributesBase class is the class that all the main attributes that can load attribute files inherit from.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 More...
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class AttributesBase : IIsEqual
<SerializableAttribute>
Public MustInherit Class AttributesBase
	Implements IIsEqual
The AttributesBase type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
LoadAttributes
 Loads the attributes from the specified file.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.Bolt.BoltAttributes
 Tekla.Structures.Drawing.DetailMark.DetailMarkAttributes
 Tekla.Structures.Drawing.DimensionSetBaseAttributes
 Tekla.Structures.Drawing.DrawingObject.NoAttributes
 Tekla.Structures.Drawing.EdgeChamfer.EdgeChamferAttributes
 Tekla.Structures.Drawing.EmbeddedObjectAttributes
 Tekla.Structures.Drawing.GraphicObject.GraphicObjectAttributes
 Tekla.Structures.Drawing.Grid.GridAttributes
 Tekla.Structures.Drawing.GridLine.GridLineAttributes
 Tekla.Structures.Drawing.LayoutAttributes
 Tekla.Structures.Drawing.LevelMark.LevelMarkAttributes
 Tekla.Structures.Drawing.LinkAttributes
 Tekla.Structures.Drawing.MarkBase.MarkBaseAttributes
 Tekla.Structures.Drawing.Part.PartAttributes
 Tekla.Structures.Drawing.PourBreak.PourBreakAttributes
 Tekla.Structures.Drawing.PourObject.PourAttributes
 Tekla.Structures.Drawing.ReferenceModel.ReferenceModelAttributes
 Tekla.Structures.Drawing.ReinforcementBase.ReinforcementBaseAttributes
 Tekla.Structures.Drawing.SectionMarkBase.SectionMarkAttributes
 Tekla.Structures.Drawing.StraightDimension.StraightDimensionAttributes
 Tekla.Structures.Drawing.Surfacing.SurfacingAttributes
 Tekla.Structures.Drawing.Symbol.SymbolAttributes
 Tekla.Structures.Drawing.Text.TextAttributes
 Tekla.Structures.Drawing.View.ViewAttributes
 Tekla.Structures.Drawing.Weld.WeldAttributes
 Tekla.Structures.Drawing.WeldMark.WeldMarkAttributes